"use strict"

console.log('number' + 3 + 3); // "number33" - тут використовується конкатинація зліва направо і просто складає числа до стрінги зліва направо в стрінгу

console.log(null + 3); // null в числовому контексті 0, 0 + 3 = 3;

console.log(5 && "qwerty"); // qwerty - тому що 5 це true і qwerty це тру і повертає останнє значення;

console.log(+'40' + +'2' + "hillel"); // 42hillel - плюс перед '40' перетворює 40 на число + плюс перед '2' перетворює 2 на число і далі + йде як контактинація і виходить 40 + 2 + 'hillel' = 42hillel;

console.log('10' - 5 === 6); // false - 10 перетворюється в число, буде 10-5 буде 5, і 5 не дорівнює 6 буде false.

console.log(true + false); // 1 - тому що true рахується як 1, а false як 0 і буде 1+0 =1;

console.log('4px' - 3); // Nan - так як стрінгу з текстом ніяк перетворити в число для мат віднімання;

console.log('4' - 3); //  1 - мінус в js завжди виконує матем віднімання, стрінга '4' перетворюється в число 4 -1 = 3;

console.log('6' + 3 ** 0); // 61 - спочатку виконується зведення в степінь так як в нього більша пріорітетність 3 в 0 степені = 1, а далі просто контактинація 6 +1 = 61;

console.log(12 / '6'); // 2 - так як якщо в стрінгі просто число воно переводить стрінгу в число для виконання арифметичної операціїї;

console.log('10' + (5 === 6)); // 10false - спочатку виконується рівність в дужках буде false і просто конкатинація.

console.log(null == ''); //false - null не може конвертуватись в пустий рядок, значить він не можу йому дорівнювати і буде false

console.log(3 ** (9 / 3)); // 27 - спочатку вираз в дужках 9 поділити на 3 буде 3 і 3 в степені 3 буде 27.

console.log(!!'false' == !!'true'); // true - подвійне не, перетворяє рядки на булевсььку форму false це перше заперечення і перетворює в True як подвійне заперечення і виходить true = true.

console.log(0 || '0' && 1); // 1 - спочатку логічне І повертає останнє true якщо всі true, і потім логічне НІ повертає перше true.

console.log((+null == false) < 1); // false - +null = 0, 0 дорівнює false, значить вираз в дужках буде true, а true не може бути менше 1 так як це 1, значить відповідь false

console.log(false && true || true); // True - перше буде логічне І повертає перший false, потім буде логічне АБо повертає перший true 

console.log(false && (false || true)); // false - спочатку дужки логічне або повертає перше true значееня (true), логічне І повертає перше false , буде false

console.log((+null == false) < 1 ** 5); // false - 0 дорівнює false буде true, далі по пріорітетності 1 в степені 5 буде 1, і true менше 1 не може бути тому false 
